Ribster/STM32-Projects/An Analog Datalogger REV A/include/projectconfig.h
// APPLICATION
#define OLED_MENUWRITING_START 0,53
#define OLED_MENUWRITING_END 127,0
#define OLED_MENUWRITING_FONT Font_System5x8
#define OLED_SUBMENUWRITING_HEADER_FONT Font_8x8
#define OLED_SUBMENUWRITING_SUBITEMS_FONT Font_System3x6
#define OLED_SUBMENUWRITING_SPACINGPIXELS_FROMHEADER 1
#define OLED_SUBMENUWRITING_SPACINGPIXELS_FROMSUBITEMS 2

	// here the orientation of stepping is from user viewpoint
		// pointerwise: UP-> left, DOWN->right, BACK->up, ENTER->down
#define OLED_MENU_STEP_UP 0x00
#define OLED_MENU_STEP_DOWN 0x01
#define OLED_MENU_STEP_BACK 0x02
#define OLED_MENU_STEP_ENTER 0x03

#define OLED_MENUWRITING_MINIMUMWIDTH_CHARSIZE 22

#define OLED_TEXTBLOCK_LEFTDOWN_X 0
#define OLED_TEXTBLOCK_LEFTDOWN_Y 0
#define OLED_TEXTBLOCK_LEFTDOWN OLED_TEXTBLOCK_LEFTDOWN_X,OLED_TEXTBLOCK_LEFTDOWN_Y
#define OLED_TEXTBLOCK_RIGHTUP_X 127
#define OLED_TEXTBLOCK_RIGHTUP_Y 53
#define OLED_TEXTBLOCK_RIGHTUP OLED_TEXTBLOCK_RIGHTUP_X,OLED_TEXTBLOCK_RIGHTUP_Y
#define OLED_TEXTBLOCK_DIMENSIONS OLED_TEXTBLOCK_LEFTDOWN,OLED_TEXTBLOCK_RIGHTUP

#define OLED_LINE_DIMENSIONS 0,55,127,55
#define OLED_DELAY_STARTUP 200

// USB
/*
70	PA11	I/O	USB_OTG_FS_DM
71	PA12	I/O	USB_OTG_FS_DP
69	PA10	I/O	USB_OTG_FS_ID

	PA9		used in usb library
	PA8		used in usb library
*/
	// initialization of usb pins is found in the usb_bsp.c file.
	// configuration is found in the usb_conf.h file
	// here the macro USE_USB_OTG_FS is used


/*
	#define USB_DM_PORT GPIOA
	#define USB_DM_PIN 11
	#define USB_DM_MODE GPIO_Mode_AF
	#define USB_DM_PULL GPIO_PuPd_NOPULL
	#define USB_DM_OTYPE GPIO_OType_PP
	#define USB_DM_SPEED GPIO_Speed_100MHz
	#define USB_DM_AF GPIO_AF_OTG_FS //AF10

	#define USB_DP_PORT GPIOA
	#define USB_DP_PIN 12
	#define USB_DP_MODE GPIO_Mode_AF
	#define USB_DP_PULL GPIO_PuPd_NOPULL
	#define USB_DP_OTYPE GPIO_OType_PP
	#define USB_DP_SPEED GPIO_Speed_100MHz
	#define USB_DP_AF GPIO_AF_OTG_FS //AF10

	#define USB_ID_PORT GPIOA
	#define USB_ID_PIN 10
	#define USB_ID_MODE GPIO_Mode_AF
	#define USB_ID_PULL GPIO_PuPd_NOPULL
	#define USB_ID_OTYPE GPIO_OType_PP
	#define USB_ID_SPEED GPIO_Speed_100MHz
	#define USB_ID_AF GPIO_AF_OTG_FS //AF10
*/


// SD CARD
/*
80	PC12	I/O	SDIO_CK
83	PD2		I/O	SDIO_CMD
65	PC8		I/O	SDIO_D0
66	PC9		I/O	SDIO_D1
78	PC10	I/O	SDIO_D2
79	PC11	I/O	SDIO_D3
*/



#define SD_DETECT_PIN                    GPIO_Pin_2                 /* PC.02 */
#define SD_DETECT_GPIO_PORT              GPIOC                      /* GPIOC */
#define SD_DETECT_GPIO_CLK               RCC_AHB1Periph_GPIOC

#define SDIO_FIFO_ADDRESS                ((uint32_t)0x40012C80)
/**
  * @brief  SDIO Intialization Frequency (400KHz max)
  */
#define SDIO_INIT_CLK_DIV                ((uint8_t)0x76)
/**
  * @brief  SDIO Data Transfer Frequency (25MHz max)
  */
#define SDIO_TRANSFER_CLK_DIV            ((uint8_t)0x0)

#define SD_SDIO_DMA                   DMA2
#define SD_SDIO_DMA_CLK               RCC_AHB1Periph_DMA2

//#define SD_SDIO_DMA_STREAM3	          3
#define SD_SDIO_DMA_STREAM6           6

#ifdef SD_SDIO_DMA_STREAM3
	#undef SD_SDIO_DMA_STREAM6
#endif

#ifdef SD_SDIO_DMA_STREAM6
	#undef SD_SDIO_DMA_STREAM3
#endif

#ifdef SD_SDIO_DMA_STREAM3
 #define SD_SDIO_DMA_STREAM            DMA2_Stream3
 #define SD_SDIO_DMA_CHANNEL           DMA_Channel_4
 #define SD_SDIO_DMA_FLAG_FEIF         DMA_FLAG_FEIF3
 #define SD_SDIO_DMA_FLAG_DMEIF        DMA_FLAG_DMEIF3
 #define SD_SDIO_DMA_FLAG_TEIF         DMA_FLAG_TEIF3
 #define SD_SDIO_DMA_FLAG_HTIF         DMA_FLAG_HTIF3
 #define SD_SDIO_DMA_FLAG_TCIF         DMA_FLAG_TCIF3
 #define SD_SDIO_DMA_IRQn              DMA2_Stream3_IRQn
 #define SD_SDIO_DMA_IRQHANDLER        DMA2_Stream3_IRQHandler
#elif defined SD_SDIO_DMA_STREAM6
 #define SD_SDIO_DMA_STREAM            DMA2_Stream6
 #define SD_SDIO_DMA_CHANNEL           DMA_Channel_4
 #define SD_SDIO_DMA_FLAG_FEIF         DMA_FLAG_FEIF6
 #define SD_SDIO_DMA_FLAG_DMEIF        DMA_FLAG_DMEIF6
 #define SD_SDIO_DMA_FLAG_TEIF         DMA_FLAG_TEIF6
 #define SD_SDIO_DMA_FLAG_HTIF         DMA_FLAG_HTIF6
 #define SD_SDIO_DMA_FLAG_TCIF         DMA_FLAG_TCIF6
 #define SD_SDIO_DMA_IRQn              DMA2_Stream6_IRQn
 #define SD_SDIO_DMA_IRQHANDLER        DMA2_Stream6_IRQHandler
#endif /* SD_SDIO_DMA_STREAM3 */

/* Uncomment the following line to select the SDIO Data transfer mode */
#if !defined (SD_DMA_MODE) && !defined (SD_POLLING_MODE)
#define SD_DMA_MODE                                ((uint32_t)0x00000000)
/*#define SD_POLLING_MODE                            ((uint32_t)0x00000002)*/
#endif
	#define SDIO_RESET_AF GPIO_AF_MCO
	#define SDIO_RESET_MODE GPIO_Mode_IN
	#define SDIO_RESET_PULL GPIO_PuPd_NOPULL
	#define SDIO_RESET_OTYPE GPIO_OType_PP
	#define SDIO_RESET_SPEED GPIO_Speed_100MHz
	// SDIO CLOCK
	#define SDIO_CK_PORT GPIOC
	#define SDIO_CK_PIN 12
	#define SDIO_CK_MODE GPIO_Mode_AF
	#define SDIO_CK_PULL GPIO_PuPd_NOPULL
	#define SDIO_CK_OTYPE GPIO_OType_PP
	#define SDIO_CK_SPEED GPIO_Speed_100MHz
	#define SDIO_CK_AF GPIO_AF_SDIO //AF12
	// SDIO COMMAND
	#define SDIO_CMD_PORT GPIOD
	#define SDIO_CMD_PIN 2
	#define SDIO_CMD_MODE GPIO_Mode_AF
	#define SDIO_CMD_PULL GPIO_PuPd_UP
	#define SDIO_CMD_OTYPE GPIO_OType_PP
	#define SDIO_CMD_SPEED GPIO_Speed_100MHz
	#define SDIO_CMD_AF GPIO_AF_SDIO //AF12
	// SDIO D0
	#define SDIO_D0_PORT GPIOC
	#define SDIO_D0_PIN 8
	#define SDIO_D0_MODE GPIO_Mode_AF
	#define SDIO_D0_PULL GPIO_PuPd_UP
	#define SDIO_D0_OTYPE GPIO_OType_PP
	#define SDIO_D0_SPEED GPIO_Speed_100MHz
	#define SDIO_D0_AF GPIO_AF_SDIO //AF12
	// SDIO D1
	#define SDIO_D1_PORT GPIOC
	#define SDIO_D1_PIN 9
	#define SDIO_D1_MODE GPIO_Mode_AF
	#define SDIO_D1_PULL GPIO_PuPd_UP
	#define SDIO_D1_OTYPE GPIO_OType_PP
	#define SDIO_D1_SPEED GPIO_Speed_100MHz
	#define SDIO_D1_AF GPIO_AF_SDIO //AF12
	// SDIO D2
	#define SDIO_D2_PORT GPIOC
	#define SDIO_D2_PIN 10
	#define SDIO_D2_MODE GPIO_Mode_AF
	#define SDIO_D2_PULL GPIO_PuPd_UP
	#define SDIO_D2_OTYPE GPIO_OType_PP
	#define SDIO_D2_SPEED GPIO_Speed_100MHz
	#define SDIO_D2_AF GPIO_AF_SDIO //AF12
	// SDIO D3
	#define SDIO_D3_PORT GPIOC
	#define SDIO_D3_PIN 11
	#define SDIO_D3_MODE GPIO_Mode_AF
	#define SDIO_D3_PULL GPIO_PuPd_UP
	#define SDIO_D3_OTYPE GPIO_OType_PP
	#define SDIO_D3_SPEED GPIO_Speed_100MHz
	#define SDIO_D3_AF GPIO_AF_SDIO //AF12
// USART
/*
87	PD6	I/O	USART2_RX
86	PD5	I/O	USART2_TX
	*/
	// UART2 as printf
	#define TERMINAL_UART USART2
	#define TERMINAL_UART_IRQN USART2_IRQn
	#define TERMINAL_BAUDRATE 230400
	#define TERMINAL_WORDLENGTH USART_WordLength_8b
	#define TERMINAL_STOPBITS USART_StopBits_1
	#define TERMINAL_PARITY USART_Parity_No
	#define TERMINAL_FLOWCONTROL USART_HardwareFlowControl_None
	#define TERMINAL_MODE USART_Mode_Rx | USART_Mode_Tx
	#define TERMINAL_IT_RX USART_IT_RXNE
	#define TERMINAL_IT_RX_IRQChannelPreemptionPriority 0x02
	#define TERMINAL_IT_RX_IRQChannelSubPriority 0
	#define TERMINAL_IT_RX_MAXSTRINGLENGTH 512
	extern char TERMINAL_receiverbuffer[TERMINAL_IT_RX_MAXSTRINGLENGTH];
	// RX PIN
	#define UART2_PORT_RX GPIOD
	#define UART2_PIN_RX 6
	#define UART2_MODE_RX GPIO_Mode_AF
	#define UART2_PULL_RX GPIO_PuPd_UP
	#define UART2_OTYPE_RX GPIO_OType_PP
	#define UART2_SPEED_RX GPIO_Speed_100MHz
	#define UART2_AF_RX GPIO_AF_USART2 // AF7
	// TX PIN
	#define UART2_PORT_TX GPIOD
	#define UART2_PIN_TX 5
	#define UART2_MODE_TX GPIO_Mode_AF
	#define UART2_PULL_TX GPIO_PuPd_UP
	#define UART2_OTYPE_TX GPIO_OType_PP
	#define UART2_SPEED_TX GPIO_Speed_100MHz
	#define UART2_AF_TX GPIO_AF_USART2 // AF7

// RTC
/*
8	PC14-OSC32_IN	I/O	RCC_OSC32_IN
9	PC15-OSC32_OUT	I/O	RCC_OSC32_OUT*/
	//#define RTC_CLOCK_SOURCE_LSE          /* LSE used as RTC source clock */
	#define RTC_CLOCK_SOURCE_LSI     /* LSI used as RTC source clock. The RTC Clock */
	#define RTC_EXTI_Line EXTI_Line17
	#define RTC_EXTI_Mode EXTI_Mode_Interrupt
	#define RTC_EXTI_Trigger EXTI_Trigger_Rising

