Ribster/STM32-Projects/An Analog Datalogger REV A/include/projectconfig.h
// Crystal
/*
12	PH0-OSC_IN	I/O	RCC_OSC_IN
13	PH1-OSC_OUT	I/O	RCC_OSC_OUT
	*/

// TESTPOINTS

/*
7	PC13-ANTI_TAMP	Output	GPIO_Output	TESTPOINT 3
26	PA3				Output	GPIO_Output	TESTPOINT 1
77	PA15			Output	GPIO_Output	TESTPOINT 2
81	PD0				Output	GPIO_Output	TESTPOINT 8
82	PD1				Output	GPIO_Output	TESTPOINT 9
84	PD3				Output	GPIO_Output	TESTPOINT 11
85	PD4				Output	GPIO_Output	TESTPOINT 12
88	PD7				Output	GPIO_Output	TESTPOINT 10
90	PB4				Output	GPIO_Output	TESTPOINT 6
96	PB9				Output	GPIO_Output	TESTPOINT 7
97	PE0				Output	GPIO_Output	TESTPOINT 4
98	PE1				Output	GPIO_Output	TESTPOINT 5
*/

#define TESTPOINT_1_PORT GPIOA
#define TESTPOINT_1_PIN 3
#define TESTPOINT_1_MODE GPIO_Mode_OUT
#define TESTPOINT_1_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_1_OTYPE GPIO_OType_PP
#define TESTPOINT_1_SPEED GPIO_Speed_100MHz
#define TESTPOINT_1_INITSTATE Bit_RESET

#define TESTPOINT_2_PORT GPIOA
#define TESTPOINT_2_PIN 15
#define TESTPOINT_2_MODE GPIO_Mode_OUT
#define TESTPOINT_2_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_2_OTYPE GPIO_OType_PP
#define TESTPOINT_2_SPEED GPIO_Speed_100MHz
#define TESTPOINT_2_INITSTATE Bit_RESET

#define TESTPOINT_3_PORT GPIOC
#define TESTPOINT_3_PIN 13
#define TESTPOINT_3_MODE GPIO_Mode_OUT
#define TESTPOINT_3_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_3_OTYPE GPIO_OType_PP
#define TESTPOINT_3_SPEED GPIO_Speed_100MHz
#define TESTPOINT_3_INITSTATE Bit_RESET

#define TESTPOINT_4_PORT GPIOE
#define TESTPOINT_4_PIN 0
#define TESTPOINT_4_MODE GPIO_Mode_OUT
#define TESTPOINT_4_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_4_OTYPE GPIO_OType_PP
#define TESTPOINT_4_SPEED GPIO_Speed_100MHz
#define TESTPOINT_4_INITSTATE Bit_RESET

#define TESTPOINT_5_PORT GPIOE
#define TESTPOINT_5_PIN 1
#define TESTPOINT_5_MODE GPIO_Mode_OUT
#define TESTPOINT_5_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_5_OTYPE GPIO_OType_PP
#define TESTPOINT_5_SPEED GPIO_Speed_100MHz
#define TESTPOINT_5_INITSTATE Bit_RESET

#define TESTPOINT_6_PORT GPIOB
#define TESTPOINT_6_PIN 4
#define TESTPOINT_6_MODE GPIO_Mode_OUT
#define TESTPOINT_6_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_6_OTYPE GPIO_OType_PP
#define TESTPOINT_6_SPEED GPIO_Speed_100MHz
#define TESTPOINT_6_INITSTATE Bit_RESET

#define TESTPOINT_7_PORT GPOIB
#define TESTPOINT_7_PIN 9
#define TESTPOINT_7_MODE GPIO_Mode_OUT
#define TESTPOINT_7_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_7_OTYPE GPIO_OType_PP
#define TESTPOINT_7_SPEED GPIO_Speed_100MHz
#define TESTPOINT_7_INITSTATE Bit_RESET

#define TESTPOINT_8_PORT GPIOD
#define TESTPOINT_8_PIN 0
#define TESTPOINT_8_MODE GPIO_Mode_OUT
#define TESTPOINT_8_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_8_OTYPE GPIO_OType_PP
#define TESTPOINT_8_SPEED GPIO_Speed_100MHz
#define TESTPOINT_8_INITSTATE Bit_RESET

#define TESTPOINT_9_PORT GPIOD
#define TESTPOINT_9_PIN 1
#define TESTPOINT_9_MODE GPIO_Mode_OUT
#define TESTPOINT_9_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_9_OTYPE GPIO_OType_PP
#define TESTPOINT_9_SPEED GPIO_Speed_100MHz
#define TESTPOINT_9_INITSTATE Bit_RESET

#define TESTPOINT_10_PORT GPIOD
#define TESTPOINT_10_PIN 7
#define TESTPOINT_10_MODE GPIO_Mode_OUT
#define TESTPOINT_10_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_10_OTYPE GPIO_OType_PP
#define TESTPOINT_10_SPEED GPIO_Speed_100MHz
#define TESTPOINT_10_INITSTATE Bit_RESET

#define TESTPOINT_11_PORT GPIOD
#define TESTPOINT_11_PIN 3
#define TESTPOINT_11_MODE GPIO_Mode_OUT
#define TESTPOINT_11_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_11_OTYPE GPIO_OType_PP
#define TESTPOINT_11_SPEED GPIO_Speed_100MHz
#define TESTPOINT_11_INITSTATE Bit_RESET

#define TESTPOINT_12_PORT GPIOD
#define TESTPOINT_12_PIN 4
#define TESTPOINT_12_MODE GPIO_Mode_OUT
#define TESTPOINT_12_PULL GPIO_PuPd_NOPULL
#define TESTPOINT_12_OTYPE GPIO_OType_PP
#define TESTPOINT_12_SPEED GPIO_Speed_100MHz
#define TESTPOINT_12_INITSTATE Bit_RESET

// UNUSED PINS

#endif /* PROJECTCONFIG_H_ */
